export const questions = [
    {
        id: 1,
        question: '낯선 강아지가 다가오면 어떻게 하나요?',
        options: ['같이 놀아준다', '그냥 지나친다'],
        type: 'E/I'
    },
    {
        id: 2,
        question: '길을 걷다가 아는 사람을 마주치면 어떻게 하나요?',
        options: ['먼저 인사를 한다', '상대가 먼저 인사해주기를 기다린다'],
        type: 'E/I'
    },
    {
        id: 3,
        question: '술자리에서 술게임이 시작되면 어떻게 하나요?',
        options: ['적극적으로 룰을 설명하고 게임을 주도한다', '구석에 앉아서 눈치를 본다'],
        type: 'E/I'
    },
    {
        id: 4,
        question: '주말에 시간 괜찮냐는 연락이 오면 어떻게 하나요?',
        options: ['바로 약속을 잡는다', '확인해보고 다시 연락하겠다고 한다'],
        type: 'E/I'
    },
    {
        id: 5,
        question: '낯선 고양이가 당신을 쳐다보면 어떻게 하나요?',
        options: ['같이 쳐다보며 눈싸움을 시작한다', '왜 쳐다보지? 하면서 지나친다'],
        type: 'E/I'
    },
    {
        id: 6,
        question: '아이스크림 가게에 가서 메뉴를 고를 때 어떻게 하나요?',
        options: ['평소 자주 먹는 메뉴를 고른다', '이름이 특이한 메뉴를 고른다'],
        type: 'S/N'
    },
    {
        id: 7,
        question: '엘리베이터에 혼자 남으면 어떻게 하나요?',
        options: ['거울을 본다', '문이 열리고 누군가 뛰어 들어오는 상상을 한다'],
        type: 'S/N'
    },
    {
        id: 8,
        question: '뻥튀기 기계를 보면 어떤 생각이 드나요?',
        options: ['언제 터지려나', '안전망을 안 씌우고 터트리면 눈 내리는 것처럼 보일까?'],
        type: 'S/N'
    },
    {
        id: 9,
        question: '휴대폰을 떨어뜨렸을 때 가장 먼저 어떤 생각이 드나요?',
        options: ['화면 깨졌으려나', '이렇게 치고 이렇게 벋았으면 안 떨어뜨렸을텐데 아쉽다'],
        type: 'S/N'
    },
    {
        id: 10,
        question: '고양이가 물건을 자꾸 떨어뜨리는 모습을 보면 어떤 생각이 드나요?',
        options: ['계속 떨어뜨리네', '떨어뜨린게 아니라 의도된 행동은 아닐까?'],
        type: 'S/N'
    },
    {
        id: 11,
        question: '튜터가 내 이름을 잘못 부르면 어떤 생각이 드나요?',
        options: ['잠시 헷갈리셨나보다', '왜 내 이름을 잘못 부르시지... 서운하다'],
        type: 'T/F'
    },
    {
        id: 12,
        question: '친구가 고민을 털어놓으면 어떻게 하나요?',
        options: ['해결책을 찾아주려고 노력한다', '그동안 힘들었겠다며 위로한다'],
        type: 'T/F'
    },
    {
        id: 13,
        question: '친구가 접촉 사고가 났다고 연락했을 때 어떤 생각이 드나요?',
        options: ['보험 회사에 연락 안하고 왜 나한테 연락했지?', '사고가 크게 났나? 많이 다치진 않았겠지?'],
        type: 'T/F'
    },
    {
        id: 14,
        question: '친구가 당신이 못 먹는 음식을 먹으러 가자고 하면 어떤 생각이 드나요?',
        options: ['나 그 음식 못 먹는거 까먹었나보네', '나 그 음식 못 먹는거 알텐데... 아니면 나한테 관심이 없나?'],
        type: 'T/F'
    },
    {
        id: 15,
        question: '친구가 약속에 늦어서 미안하다고 사과하면 어떤 생각이 드나요?',
        options: ['왜 늦었는지에 대한 설명이 먼저 아닌가?', '진심으로 사과하니까 오늘은 그냥 넘어가자!'],
        type: 'T/F'
    },
    {
        id: 16,
        question: '길을 걷다가 갑자기 비가 오면 어떻게 하나요?',
        options: ['가방에서 휴대용 우산을 꺼내든다', '근처 편의점에 가서 우산을 산다'],
        type: 'J/P'
    },
    {
        id: 17,
        question: '친구와의 약속으로 외출을 할 때 어떻게 하나요?',
        options: ['버스가 몇 분 뒤에 오는지 확인한다', '일단 출발한다'],
        type: 'J/P'
    },
    {
        id: 18,
        question: '공짜로 주는 간식이 있다면 어떻게 하나요?',
        options: ['당장 먹을만큼만 가져간다', '일단 여러 개 가져간다'],
        type: 'J/P'
    },
    {
        id: 19,
        question: '마감 기한이 촉박한 과제가 주어지면 어떻게 하나요?',
        options: ['시간 혹은 날짜별 계획을 먼저 세운다', '일단 시작한다'],
        type: 'J/P'
    },
    {
        id: 20,
        question: '여행을 가게 되면 어떤 스타일을 선호하나요?',
        options: ['계획된 일정에 따르는 여행', '당일에 즉흥적으로 일정을 정하는 여행'],
        type: 'J/P'
    }
];
